export default function Home() {
  return (
    <div>
      "Купим вместе" — это сервис, созданный для помощи людям в объединении для
      совместных покупок. Например, если вы купили квартиру в жилом комплексе
      или у вас есть дача в садовом товариществе, вы можете объединиться со
      своими соседями или найти соседей с помощью данного сервиса, чтобы
      сэкономить на доставке крупногабаритных товаров и различных
      стройматериалов. Например, если вы хотите построить пристройку и
      планируете купить машину обрезного пиломатериала, а ваш сосед планирует
      построить веранду и ему тоже нужен пиломатериал, тогда вы можете с ним
      объединиться и заказать одну машину на двоих, тем самым сэкономив на
      доставке.
      <br></br>
      "Купим вместе" предлагает три ключевые вкладки - "Чат на карте", "Поиск
      попутных машин" и "Где купить".
      <br></br>
      Вкладка "Чат на карте" позволяет обмениваться сообщениями, размещая их на
      карте. Основные функции включают: Добавление тем: Пользователи могут
      создавать темы для обсуждения и добавлять маркеры с сообщениями. Удаление
      тем: Можно удалить тему, но только после удаления всех связанных с ней
      маркеров. Выбор тем: Пользователи могут выбрать из существующих тем. Если
      тема не выбрана, система предупреждает об этом. Просмотр маркеров по
      темам: Предоставляет возможность просмотреть все маркеры, связанные с
      выбранной темой. Добавление сообщений: Для этого нужно выбрать тему и
      ввести текст сообщения, который затем отображается на карте.
      <br></br>
      На вкладке "Поиск попутных машин" Вы можете посмотреть или добавить
      информацию о попутных машинах. На вкладке используются два поля для ввода
      начальной и конечной точки маршрута. В процессе ввода адреса появляются
      подсказки для уточнения местоположения, которые можно выбрать. После того
      как пользователь ввел оба адреса и нажал кнопку "Добавить маршрут",
      маршрут появляется на карте. Каждый маршрут на карте можно удалять по
      отдельности, нажав на соответствующую кнопку в информационном окне
      маршрута. В случае, если введенный адрес не найден или при других ошибках,
      пользователь получает соответствующее сообщение об ошибке.
    </div>
  );
}
